In [1]:
from datetime import datetime
import pandas as pd

## Load data

In [14]:
date_today = datetime.today().strftime('%Y-%m-%d')

cleaned_deduped_authors_filename = "data/MCK-CX_2022-10-09magazine_authors_newly_merged.csv"
newly_parsed_authors_filename = "data/magazine_authors_parsed.csv"
new_authors_batch_filename = f"data/magazine_authors_new_batch-{date_today}.xlsx"
newly_merged_authors_filename = f"data/magazine_authors-{date_today}-merged.xlsx"

In [3]:
cleaned_deduped_authors = pd.read_csv(cleaned_deduped_authors_filename)

In [4]:
cleaned_deduped_authors.head()

,drupal_full_name,drupal_author_id,duplicate of ID,given_name,family_name,organization_name,meeting_name,Notes
0,Carl Abbott,1352,NaN,Carl,Abbott,NaN,NaN,NaN
1,Marge Abbott,2931,343.0,Margery Post,Abbott,NaN,NaN,NaN
2,Margery Post Abbott,3430,343.0,Margery Post,Abbott,NaN,NaN,NaN
3,Margery Abbott,3267,343.0,Margery Post,Abbott,NaN,NaN,NaN
4,Margery Post Abbott,343,NaN,Margery Post,Abbott,NaN,NaN,NaN

In [5]:
cleaned_deduped_authors.shape

(2774, 8)

In [6]:
newly_parsed_authors = pd.read_csv(newly_parsed_authors_filename)

In [7]:
newly_parsed_authors.head()

   given_name family_name     drupal_full_name  drupal_author_id  civicrm_id
0       A. N.   Whitehead      A. N. Whitehead              1832         NaN
1          A.          S.                A. S.              1597         NaN
2   A. Sidney      Wright     A. Sidney Wright              1789         NaN
3  A. Stanley    Thompson  A. Stanley Thompson              2801         NaN
4        A.F.    Anderson        A.F. Anderson              2615         NaN

In [8]:
newly_parsed_authors.shape

(3106, 5)

## Select new authors (and export for review)

In [9]:
# select newly parsed authors that are NOT in the cleaned deduped authors
new_authors = newly_parsed_authors[~newly_parsed_authors["drupal_author_id"].isin(cleaned_deduped_authors["drupal_author_id"])]

In [15]:
new_authors.to_excel(new_authors_batch_filename, index=False)

## Merge new authors into existing spreadsheet

We will use the Drupal ID to skip existing rows and add only new authors to the merged spreadsheet.

In [96]:
newly_merged_authors_for_export = pd.concat([cleaned_deduped_authors, new_authors])

In [97]:
newly_merged_authors_for_export.sort_values(by="drupal_full_name", inplace=True)

In [98]:
# make sure the row counts match
assert new_authors.shape[0] + cleaned_deduped_authors.shape[0] == newly_merged_authors_for_export.shape[0]

## Export

In [99]:
newly_merged_authors_for_export.to_excel(newly_merged_authors_filename, index=False)